#+title:      A Klasse 2023-27
#+date:       [2023-07-08 Sa 14:38]
#+filetags:   :1a:Project:
#+identifier: 20230708T143857
#+STARTUP: showall
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+TODO: TODO(t) STARTED(s!) WAITING(w@/!) APPT(a) PROJ(p) NOTIZ(n) NEXT(x) BESPROCHEN(b) DELEGATED(g@/!) | DONE(d!) CANCELED(c@)
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/1a.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 1A MINT [KV Mirjam Seiwald]
#+Name: 2021-students
| First      | Last            | Name                 | Note | Mitarbeit | Heft | LZK |
|------------+-----------------+----------------------+------+-----------+------+-----|
| Jakob      | Astner          | [[Jakob Astner][Jakob Astner]]         |    1 |           |      |     |
| Can        | Bayraktar       | [[Can Bayraktar][Can Bayraktar]]        |    1 |           |      |     |
| Hanna      | Bernhofer       | [[Hanna Bernhofer][Hanna Bernhofer]]      |      |           |      |     |
| Philipp    | Breinlinger     | [[Philipp Breinlinger][Philipp Breinlinger]]  |    1 |           |      |     |
| Alma       | Entfellner      | [[Alma Entfellner][Alma Entfellner]]      |    1 |           |      |     |
| Peter      | Harlander       | [[Peter Harlander][Peter Harlander]]      |    1 |           |      |     |
| Ivelin     | Ivanov          | [[Ivelin Ivanov][Ivelin Ivanov]]        |    1 |           |      |     |
| Lea        | Kainhofer       | [[Lea Kainhofer][Lea Kainhofer]]        |    1 |           |      |     |
| Martin     | Kappacher       | [[Martin Kappacher][Martin Kappacher]]     |      |           |      |     |
| Ema        | Ljubic          | [[Ema Ljubic][Ema Ljubic]]           |      |           |      |     |
| Emilia     | Loidl           | [[Emilia Loidl][Emilia Loidl]]         |    1 |           |      |     |
| Malena     | Müller          | [[Malena Müller][Malena Müller]]        |    1 |           |      |     |
| Anna-Lena  | Oberhauser      | [[Anna-Lena Oberhauser][Anna-Lena Oberhauser]] |    1 |           |      |     |
| Felix      | Putz            | [[Felix Putz][Felix Putz]]           |      |           |      |     |
| Julia      | Rettenbacher    | [[Julia Rettenbacher][Julia Rettenbacher]]   |      |           |      |     |
| Moritz     | Russegger       | [[Moritz Russegger][Moritz Russegger]]     |    1 |           |      |     |
| Nina       | Sattlberger     | [[Nina Sattlberger][Nina Sattlberger]]     |    1 |           |      |     |
| Ana        | Sokic           | [[Ana Sokic][Ana Sokic]]            |    1 |           |      |     |
| Tobias     | Starzacher      | [[Tobias Starzacher][Tobias Starzacher]]    |    1 |           |      |     |
| Luca       | Steiner         | [[Luca Steiner][Luca Steiner]]         |      |           |      |     |
| Lara       | Struber-Steiner | [[Lara Struber-Steiner][Lara Struber-Steiner]] |      |           |      |     |
| Manuel     | Tikvic          | [[Manuel Tikvic][Manuel Tikvic]]        |      |           |      |     |
| Valentina  | Tillian         | [[Valentina Tillian][Valentina Tillian]]    |      |           |      |     |
| Maximilian | Wallmann        | [[Maximilian Wallmann][Maximilian Wallmann]]  |    1 |           |      |     |
| Jasmin     | Zuchristian     | [[Jasmin Zuchristian][Jasmin Zuchristian]]   |      |           |      |     |
|------------+-----------------+----------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2));%.0f

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: ' + first + '' + last + '')
      print('|-------+-------+------+---------|')
      print('| Datum | Topic | Note | Notizen |')
      print('|-------+-------+------+---------|')
      print('\n')
      print('*** Note ' + first + ' ' + last + '')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
